/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "banner": {
      "type": "main-collection-banner",
      "settings": {
        "show_collection_description": false,
        "show_collection_image": false,
        "color_scheme": "scheme-1"
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "settings": {
        "collection": "",
        "products_per_page": 16,
        "columns_desktop": 4,
        "columns_mobile": "2",
        "color_scheme": "scheme-1",
        "image_ratio": "square",
        "image_shape": "default",
        "show_secondary_image": true,
        "show_vendor": false,
        "show_rating": false,
        "quick_add": "standard",
        "enable_filtering": true,
        "filter_type": "horizontal",
        "enable_sorting": true,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "rich_text_3NWaHm": {
      "type": "rich-text",
      "blocks": {
        "text_xyYB4n": {
          "type": "text",
          "settings": {
            "text": "<h2><strong>The Ultimate Gift: Signature Cake Jars by Sunflour Baking Company</strong></h2><p>Welcome to <a href=\"/\" title=\"/\">Sunflour Baking Company</a>, where our passion for authentic, scratch-made pastries is reimagined in our signature <strong>cake jars</strong>. These portable desserts offer a sophisticated way to enjoy our most beloved recipes anytime, anywhere. Imagine the indulgence of a decadent slice of cake, layered with velvety frosting and premium fillings, all elegantly sealed in a charming glass jar. At Sunflour, we believe every occasion deserves a touch of artisanal sweetness, and our <strong>cake jars</strong> are meticulously crafted to deliver that experience directly to your door.</p><h3><strong>The Sunflour Secret: Why We Make the Best Cake Jars</strong></h3><p>At Sunflour, we don’t just bake—we curate edible moments of joy. Our <strong>cake jars</strong> are prepared with the same integrity and premium, local ingredients that have made our Charlotte, NC, bakeries a local staple since 2009.</p><p>Unlike mass-produced treats, our process is purely artisanal:</p><ul><li><strong>From-Scratch Foundations:</strong> We start with tender, moist cakes baked in small batches—never from a mix.</li><li><strong>Hand-Crumbled & Layered:</strong> Each cake is crumbled by hand and lovingly layered with our house-made buttercreams.</li><li><strong>Sealed for Excellence:</strong> Every dessert jar is a miniature masterpiece, packed to the brim and sealed to ensure peak freshness upon arrival.</li></ul><p>We are proud to offer a unique treat that captures the warmth of a neighborhood bakery and the refined quality of a gourmet gift.</p><h3><strong>Elegant Gifting Made Simple: Nationwide Cake Jar Delivery</strong></h3><p>Whether you are celebrating a milestone or sending a \"just because\" surprise, our <strong>birthday cake jars</strong> serve as the ultimate personal party favor. They offer a polished, no-mess alternative to traditional cakes, making them the ideal choice for corporate gifting, holidays, or long-distance celebrations.</p><p>Our reliable delivery service makes it effortless to send a taste of Sunflour across the country. From thoughtful corporate packages to heartfelt personal presents, our <strong>cake jars</strong> ensure your recipients feel celebrated, regardless of the distance.</p><p><strong>Explore our collection today and share the gift of a perfect, personal-sized cake jar.</strong></p>"
          }
        }
      },
      "block_order": [
        "text_xyYB4n"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 40,
        "padding_bottom": 80
      }
    },
    "collapsible_content_AKQx9L": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_row_GP998z": {
          "type": "collapsible_row",
          "settings": {
            "heading": "How long do your cake jars stay fresh?",
            "icon": "check_mark",
            "row_content": "<p>Because we bake everything from scratch without artificial preservatives, we recommend enjoying your <strong>cake jars</strong> within 7–10 days of arrival if kept refrigerated. For the best tasting experience, allow the jar to come to room temperature for about 30 minutes before serving—this ensures our house-made buttercream is perfectly silky and flavorful.</p>",
            "page": ""
          }
        },
        "collapsible_row_8Cipz7": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Do you offer nationwide shipping for your cake jars?",
            "icon": "check_mark",
            "row_content": "<p>Yes! We provide reliable delivery across the United States, making it easy to send a sweet surprise to loved ones or colleagues. Each <strong>cake jar</strong> is carefully packaged to ensure it arrives in pristine condition. Whether you are ordering a single treat or a bulk gift, our shipping service brings the authentic Sunflour experience from our Charlotte kitchen directly to any doorstep.</p>",
            "page": ""
          }
        },
        "collapsible_row_gGmkdP": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Are these cake jars suitable for corporate gifting or large events?",
            "icon": "check_mark",
            "row_content": "<p>Absolutely. Our <strong>cake jars</strong> are a sophisticated, no-mess alternative to traditional cakes, making them a premier choice for <a href=\"/pages/corporate-gift\" title=\"Corporate Gift\">corporate gifts,</a> <a href=\"/pages/weddings\" title=\"Weddings\">wedding favors</a>, and holiday celebrations. Their portable nature and elegant presentation in glass jars provide a high-end \"unboxing\" experience that leaves a lasting impression on clients and guests alike.</p>",
            "page": ""
          }
        },
        "collapsible_row_aHHjbp": {
          "type": "collapsible_row",
          "settings": {
            "heading": "What makes Sunflour cake jars different from other \"cake in a jar\" products?",
            "icon": "check_mark",
            "row_content": "<p>The Sunflour difference lies in our commitment to artisanal quality. While many \"cake in a jar\" options rely on pre-made mixes and shortcuts, our <strong>cake jars</strong> are handmade from basic raw materials in small batches. We use premium, local ingredients and hand-crumble our moist cakes to ensure a perfect harmony of texture and flavor in every spoonful.</p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_row_GP998z",
        "collapsible_row_8Cipz7",
        "collapsible_row_gGmkdP",
        "collapsible_row_aHHjbp"
      ],
      "name": "t:sections.collapsible_content.presets.name",
      "settings": {
        "caption": "",
        "heading": "Cake Jar FAQs",
        "heading_size": "h1",
        "heading_alignment": "center",
        "layout": "none",
        "container_color_scheme": "",
        "color_scheme": "",
        "open_first_collapsible_row": false,
        "image_ratio": "adapt",
        "desktop_layout": "image_second",
        "padding_top": 36,
        "padding_bottom": 36
      }
    }
  },
  "order": [
    "banner",
    "product-grid",
    "rich_text_3NWaHm",
    "collapsible_content_AKQx9L"
  ]
}
