{"sections":{"banner":{"type":"main-collection-banner","settings":{"show_collection_description":false,"show_collection_image":false,"color_scheme":"scheme-1"}},"product-grid":{"type":"main-collection-product-grid","settings":{"collection":"","products_per_page":16,"columns_desktop":4,"columns_mobile":"2","color_scheme":"scheme-1","image_ratio":"square","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"standard","enable_filtering":true,"filter_type":"horizontal","enable_sorting":true,"padding_top":36,"padding_bottom":36}},"rich_text_hYfKTL":{"type":"rich-text","blocks":{"text_4yhHma":{"type":"text","settings":{"text":"<h2>Sunflour Baking Company: Your Favorite Cakes, Perfected in a Jar<\/h2><h3><\/h3><p>Welcome to the Sunflour Baking Company, where we've taken our passion for scratch-made, delicious bakes and perfected them in our signature cake jars! These portable desserts are a delightful way to enjoy our beloved cakes anytime, anywhere. Imagine indulging in a decadent slice of cake, layered with creamy frosting, all sealed fresh in a convenient, charming mason jar. We believe that every moment deserves a touch of sweetness, and our cake jars are crafted to deliver just that.<br\/><br\/><\/p><p><\/p><h3><strong>Our Secret to the Best Cakes in a Jar<\/strong><\/h3><p><\/p><p>At Sunflour, we're not just baking—we're creating edible joy. Our jars of cake are made with the same love, care, and premium, local ingredients you've come to expect from our Charlotte, NC, bakeries. We start with tender, moist cake baked from scratch, crumble it by hand, and then lovingly layer it with our house-made buttercreams and fillings. The result is a perfect harmony of flavors and textures in every spoonful. Each dessert jar is a miniature masterpiece, packed to the brim and sealed for peak freshness. We're proud to offer these unique treats that capture the warmth and quality of homemade bakes, delivered right to your door.<br\/><br\/><\/p><h3><strong>Perfect for Any Occasion, Delivered to You<\/strong><\/h3><p><\/p><p>Whether you're celebrating a special day or simply treating yourself, our birthday cake jars are the ultimate personal party favor. They’re a fun, no-mess alternative to a full-sized cake, making them ideal for birthdays, holidays, or corporate gifts. Get cake jars delivered,<strong> <\/strong>our shipping<strong> <\/strong>service makes it easy to send a little sweetness across the country, ensuring your loved ones feel celebrated no matter the distance. From a quick dessert to a thoughtful present, these delightful cakes in jars are a perfect fit.<\/p><p>We know that finding quality cake in a jar near me can be a challenge. That's why we've made it simple to get our delicious, scratch-made cake jars shipped right to you. No matter if you're local to Charlotte or miles away, we bring the best of Sunflour right to your home. Explore our collection today and experience the pure joy of a personal-sized jar of cake!<\/p>"}}},"block_order":["text_4yhHma"],"disabled":true,"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"center","content_alignment":"left","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":80}}},"order":["banner","product-grid","rich_text_hYfKTL"]}