{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"m_page_hero_HKyaat":{"type":"m-page-hero","name":"Custom page hero","settings":{"heading":"FAQ"}},"m_page_rich_text_7wxnq8":{"type":"m-page-rich-text","name":"Custom page rich text","settings":{"heading":"Do You Have a Warranty?","heading_left":true,"content":"<p>At Marc Robinson Jewelers, we stand behind the quality of our products. All purchases of <strong>10K, 14K, and 18K gold and silver jewelry<\/strong> come with a <strong>lifetime warranty<\/strong> against manufacturing defects. This warranty covers the authenticity and craftsmanship of your jewelry, but <strong>does not cover damage, breakage, or repairs after 90<\/strong> <strong>days<\/strong> from the date of purchase. <br\/><br\/>We also offer a comprehensive care plan that covers cleaning, polishing, resizing, and replacing missing diamonds.<br\/><br\/>Please note that <strong>special orders<\/strong>, <strong>custom orders, layaway deposits, and jewelry or watch repairs<\/strong> are not included under this warranty. Our warranty ensures that your jewelry maintains its quality and value when cared for properly.<br\/><br\/>For exchanges, items must be returned within <strong>7 days of purchase<\/strong> in their <strong>original, complete condition<\/strong>. For any questions regarding our jewelry warranty, repairs, or coverage, <strong>our customer service team is available<\/strong> to provide guidance and support, helping you protect and enjoy your investment.<br\/><br\/><\/p>"}},"m_page_rich_text_kMkwbT":{"type":"m-page-rich-text","name":"Custom page rich text","settings":{"heading":"Do You Offer Financing?","heading_left":true,"content":"<p>Marc Robinson Jewelers offers flexible financing through <strong>Affirm<\/strong>, making it easier to purchase the jewelry and watches you love. With Affirm, you can split your purchase into <strong>simple monthly payments.<\/strong> The exact monthly amount is <strong>based on the total price of your order<\/strong>, including taxes and fees, and is calculated at checkout. More financing options are available for <strong>in-store purchases<\/strong> <strong>only<\/strong>, such as Synchrony, Ideal, Citi, America’s First Finance, Acima, Snap, and Progressive. <br\/><br\/>Applying for financing with Affirm provides a quick loan decisioning experience. Affirm performs a soft credit check that does <strong>not impact your credit score<\/strong>, and you’ll have a decision within seconds. Interest rates and payment schedules vary depending on your credit and the purchase price. Please visit Affirm site <a href=\"https:\/\/www.affirm.com\/disclosure\" target=\"_blank\" title=\"Affirm Terms & Conditions\">here<\/a> (<a href=\"https:\/\/www.affirm.com\/disclosures\" target=\"_blank\">https:\/\/www.affirm.com\/disclosure)<\/a> to view the full terms and conditions.<br\/><br\/>It’s important to understand that <strong>monthly payments are fixed once approved<\/strong>, and missing a payment can affect your credit. Financing is available for all eligible products, allowing you to <strong>shop luxury jewelry and watches with manageable payments<\/strong>. For questions about using Affirm, payment plans, or eligibility, our customer service team is <strong>ready to assist. <\/strong><br\/><br\/><\/p>"}}},"order":["main","m_page_hero_HKyaat","m_page_rich_text_7wxnq8","m_page_rich_text_kMkwbT"]}