{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"m_page_hero_Dcdn6H":{"type":"m-page-hero","name":"Custom page hero","settings":{"heading":"Shipping & Returns"}},"m_page_rich_text_ipKNJD":{"type":"m-page-rich-text","name":"Custom page rich text","settings":{"heading":"Shipping","heading_left":true,"content":"<p>At Marc Robinson Jewelers, we offer fast and secure <strong>jewelry shipping<\/strong> to ensure your order arrives safely. Choose from two convenient options:<strong> Ground <\/strong>and<strong> Standard <\/strong>– with free ground shipping for orders above $999.<br\/><br\/>All orders are carefully packaged to protect your jewelry during transit. While we strive for timely delivery, actual arrival times may vary due to carrier delays, weather, or other unforeseen circumstances. Once your order ships, you will receive tracking information so you can monitor your package every step of the way.<br\/><br\/>Please <strong>verify your shipping address at checkout to avoid delays and ensure accurate delivery<\/strong>. Orders will be shipped to the address provided at checkout, so please ensure your information is correct. For questions about <strong>secure delivery, order tracking, or shipping options<\/strong>, our customer service team is always ready to assist.<br\/><br\/><\/p>"}},"m_page_rich_text_mLVyX3":{"type":"m-page-rich-text","name":"Custom page rich text","settings":{"heading":"Returns Policy","heading_left":true,"content":"<p>At Marc Robinson Jewelers, we want you to be fully satisfied with your purchase. Our <strong>jewelry returns<\/strong> policy allows you to return items within <strong>7 days of delivery<\/strong>. To qualify, items must be in their <strong>original, complete condition<\/strong> with all original packaging intact. Custom orders, Special Orders,  jewelry\/watch repairs, and layaway deposits are <strong>not eligible<\/strong> for returns.<\/p><p>The return policy <strong>only applies to<\/strong> <strong>online purchases<\/strong>. All in-store purchases will be considered final and <strong>do not qualify for returns<\/strong>.<\/p><p>To initiate a return, please include your order number and completed returns form, and ship the item via <strong>insured, registered mail<\/strong> at your own expense. Once we receive and inspect your return, refunds will be processed to your original payment method within 7 days.<\/p><p>Exchanges are available <strong>only within 7 days of purchase<\/strong>. Products must be in original condition. Please note that the store is <strong>not responsible for any repairs remaining after 90 days<\/strong> of purchase.<\/p><p>For questions regarding our <strong>return policy, jewelry exchanges, or warranty coverage<\/strong>, our customer service team is ready to assist.<br\/><\/p><p><\/p><p><br\/><\/p>"}}},"order":["main","m_page_hero_Dcdn6H","m_page_rich_text_ipKNJD","m_page_rich_text_mLVyX3"]}